html/portfolio/472hw1.asm.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-10 Sat 14:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Ethan Smith" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div class="org-src-container">
<pre class="src src-asm"><span class="linenr"> 1: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********************************</span>
<span class="linenr"> 2: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr"> 3: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Title: StarFill (in Memory lane)</span>
<span class="linenr"> 4: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr"> 5: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Objective: COMPEN472 Homework 1</span>
<span class="linenr"> 6: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr"> 7: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Revision: V2</span>
<span class="linenr"> 8: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr"> 9: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Date: 27 Aug 2022</span>
<span class="linenr">10: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">11: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Programmer: Ethan Smith</span>
<span class="linenr">12: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">13: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Company: The Pennsylvania State University</span>
<span class="linenr">14: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Electrical Engineering and Computer Science</span>
<span class="linenr">15: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">16: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Algorithm: Simple while-loop demo of HCS12 assembly program</span>
<span class="linenr">17: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">18: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Register use: A accumulator: character data to be filled</span>
<span class="linenr">19: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*               B accumulator: counter, number of filled locations</span>
<span class="linenr">20: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*               X register: memory address pointer</span>
<span class="linenr">21: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">22: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Memory Use: RAM Locations from $3000 to $30C9</span>
<span class="linenr">23: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">24: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Input: Parameters hard coded in the program</span>
<span class="linenr">25: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">26: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Output: Data filled in memory locations, from $3000 to $30C9</span>
<span class="linenr">27: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">28: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Observation: This program is designed for instruction purpose.</span>
<span class="linenr">29: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* This program can be used as a 'loop' template</span>
<span class="linenr">30: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">31: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Note: This is a good example of program comments</span>
<span class="linenr">32: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* All Homework programs MUST have comments similar</span>
<span class="linenr">33: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* to this Homework 1 Program. So, please use this</span>
<span class="linenr">34: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* comment format for all your subsequent CMPEN 472</span>
<span class="linenr">35: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Homework programs.</span>
<span class="linenr">36: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">37: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Adding more explanations and comments help you and</span>
<span class="linenr">38: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* others to understand your program later.</span>
<span class="linenr">39: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">40: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Comments: This program is developed and simulated using CodeWarrior</span>
<span class="linenr">41: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* development software</span>
<span class="linenr">42: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">43: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*********************************************************</span>
<span class="linenr">44: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Parameter Declearation Section</span>
<span class="linenr">45: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">46: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Export Symbols</span>
<span class="linenr">47: </span>        <span style="color: #e45649;">XDEF</span>        Entry   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">export 'pgstart' symbol</span>
<span class="linenr">48: </span>        <span style="color: #e45649;">ABSENTRY</span>    Entry   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">for assembly entry point</span>
<span class="linenr">49: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Symbols and Macros</span>
<span class="linenr">50: </span><span style="color: #a626a4;">PORTA</span>   <span style="color: #e45649;">equ</span>         $0000   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">i/o port addresses</span>
<span class="linenr">51: </span><span style="color: #a626a4;">PORTB</span>   <span style="color: #e45649;">equ</span>         $0001
<span class="linenr">52: </span><span style="color: #a626a4;">DDRA</span>    <span style="color: #e45649;">equ</span>         $0002
<span class="linenr">53: </span><span style="color: #a626a4;">DDRB</span>    <span style="color: #e45649;">equ</span>         $0003
<span class="linenr">54: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*********************************************************</span>
<span class="linenr">55: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Data Section</span>
<span class="linenr">56: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">57: </span>        <span style="color: #e45649;">org</span>     $3000   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reserved memory starting address</span>
<span class="linenr">58: </span><span style="color: #a626a4;">here</span>    <span style="color: #e45649;">DS.B</span>    $CA     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">202 memory locations reserved</span>
<span class="linenr">59: </span><span style="color: #a626a4;">count</span>   <span style="color: #e45649;">DC.B</span>    $CA     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">constant. star count = 202</span>
<span class="linenr">60: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*********************************************************</span>
<span class="linenr">61: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Program Section</span>
<span class="linenr">62: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">63: </span>        <span style="color: #e45649;">org</span>     $3100   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">program start address, in RAM</span>
<span class="linenr">64: </span><span style="color: #a626a4;">Entry</span>   <span style="color: #e45649;">ldaa</span>    #'*'    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load '*' into accumulator A</span>
<span class="linenr">65: </span>        <span style="color: #e45649;">ldab</span>    count   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load star counter into B</span>
<span class="linenr">66: </span>        <span style="color: #e45649;">ldx</span>     #here   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load address pointer into X</span>
<span class="linenr">67: </span><span style="color: #a626a4;">loop</span>    <span style="color: #e45649;">staa</span>    <span style="color: #50a14f;">0</span>, x    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">put a star</span>
<span class="linenr">68: </span>        <span style="color: #e45649;">inx</span>             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">point to next location</span>
<span class="linenr">69: </span>        <span style="color: #e45649;">decb</span>            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">decrease counter</span>
<span class="linenr">70: </span>        <span style="color: #e45649;">bne</span>     loop    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if not done, repeat</span>
<span class="linenr">71: </span><span style="color: #a626a4;">done</span>    <span style="color: #e45649;">bra</span>     done    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">task finished</span>
<span class="linenr">72: </span>                        <span style="color: #9ca0a4;">;  </span><span style="color: #9ca0a4;">do nothing</span>
<span class="linenr">73: </span>
<span class="linenr">74: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">75: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Add any subroutines here</span>
<span class="linenr">76: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr">77: </span>
<span class="linenr">78: </span>        <span style="color: #e45649;">END</span>             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">last line of a file</span>
</pre>
</div>
</div>
</body>
</html>